app/controllers/acquisitions_controller.rb

SELECT "acquisitions".* FROM "acquisitions"
---
  def index
    if current_user.isAdmin
      #@acquisitions = Acquisition.joins(:allocation, :placement, :items).select('placements.*').select('acquisitions.*')
      @acquisitions = Acquisition.all