app/controllers/allocations_controller.rb

  def index
    if current_user.isAdmin
      #@allocations = Allocation.joins(:items, :placement)
      @allocations = Allocation.all
---
SELECT "allocations".* FROM "allocations"