app/controllers/items_controller.rb

SELECT "items".* FROM "items"
---
  def index
    @items = Item.all.order(created_at: :desc).page params[:page]

    if params.key? :item
      unless params[:item][:parkable_item_type].blank?