app/controllers/operators_controller.rb

SELECT "operators".* FROM "operators"
---
  def index
    @operators = Operator.all

INSERT INTO "operators" ("name", "login", "email", "password_digest", "canAlocate", "canBuy", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @operator = Operator.new(operator_params)
    #if @operator.save
    #  session[:user_id] = @operator.id
    #end

    respond_to do |format|
      if @operator.save

UPDATE "operators" SET "password_digest" = ?, "updated_at" = ? WHERE "operators"."id" = ?  [["password_digest", "$2a$10$HFi8H1Qyxy0u.wkYBlMMwO7qHkWvJttTTCNByiPkWF6NUS/dbW7f."], ["updated_at", "2017-10-13 15:07:49.536805"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @operator.update(operator_params)

SELECT  "operators".* FROM "operators" WHERE "operators"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_operator
      @operator = Operator.find(params[:id])