app/controllers/sessions_controller.rb

SELECT  "operators".* FROM "operators" WHERE "operators"."email" = ? LIMIT 1  [["email", "rcjn"]]
---
  def create
    user = Operator.find_by_email(params[:email])